[
  {
    "id": "wordlywise3000",
    "course": {
      "title": "WORDLY WISE 3000 & Grammar",
      "coverImage": "/images/readingwriting.jpg",
      "overviewTitle": "Course Overview",
      "overviewText": "This course builds critical literacy skills by strengthening reading comprehension, vocabulary, grammar, and written expression. Students learn to analyze texts, organize ideas, and communicate clearly through structured writing tasks, supporting their growth across all subject areas."
    },
    "teachers": [
      {
        "name": "Mr. Stephen Ni",
        "photo": "/images/stephen.png",
        "education": "Founder of Vanlearn Education",
        "description": "Founder of Vanlearn International Education, with 20 years of university English teaching experience. An IELTS/TOEFL all-subject instructor holding a CERTESL (Certificate in Teaching English as a Second Language). Previously served as a lead reading and writing instructor at well-known training institutions such as New Oriental and Longre. Specializes in teaching and research in Adult ESL, Children’s ELL, and English Reading and Writing courses. Advocates a student-centered teaching philosophy that emphasizes the teacher’s role as a facilitator."
      }
    ]
  },
  {
    "id": "englishreadingwriting",
    "course": {
      "title": "English Reading & Writing",
      "coverImage": "/images/readingwriting-2.jpg",
      "overviewTitle": "Course Overview",
      "overviewText": "This course builds critical literacy skills by strengthening reading comprehension, vocabulary, grammar, and written expression. Students learn to analyze texts, organize ideas, and communicate clearly through structured writing tasks, supporting their growth across all subject areas."
    },
    "teachers": [
      {
        "name": "Ms. Jillian",
        "photo": "/images/jillian.jpg",
        "education": "UBC Engineering",
        "description": "UBC Engineering graduate and a TEFL certified tutor. 5+ years of experience tutoring in math, the sciences, and English to students aged 5-40 from all different backgrounds.2 years of experience teaching English in public schools overseas. My experience, patience, and dedication have helped me build meaningful connections with my students and to work with them to develop lessons that best meet their needs."
      },
      {
        "name": "Ms. Jessica Wendland",
        "photo": "/images/jessica.jpg",
        "education": "",
        "description": "After achieving a bachelor’s degree in linguistics, I found that I enjoy working with languages. I teach English as a second language to students anywhere between kindergarten age to adults. I cover all aspects of language; speaking, reading, writing and listening. However, I can focus on one more than another if that is preferred. I like working with people and being a part of their learning journeys. I strongly believe one can go or do anything having the ability to use another language, especially English with its growing popularity."
      },
      {
        "name": "Ms. Brianne Arsenault",
        "photo": "/images/brianne.jpg",
        "education": "",
        "description": "I graduated from the University of Saskatchewan in 2020 with my Bachelor of Education and began my teaching career that same year. Since then, I have gained experience working with students across all grade levels. I am especially passionate about literacy and helping students strengthen their English language skills. I work to design individualized and engaging lessons that support each learner’s unique needs and goals. My aim is to help students build confidence, curiosity, and a lasting love of learning."
      }
    ]
  },
  {
    "id": "publicspeaking",
    "course": {
      "title": "Public Speaking & Debate",
      "coverImage": "/images/publicspeaking.jpg",
      "overviewTitle": "Course Overview",
      "overviewText": "Leaders of Tomorrow is a professionally designed program dedicated to developing young people's leadership skills. Through time-tested concepts, tutorials, and instructors, we help young people not only overcome the fear and tension of public speaking, but improve effective communication and build confidence in interpersonal communication."
    },
    "teachers": [
      {
        "name": "Ms. Jeanie David",
        "photo": "/images/jeanie.jpg",
        "education": "",
        "description": "Jeanie David is passionate about encouraging and developing speaking and leadership qualities in students. She brings over 30 years' experience teaching and guiding children. Jeanie has taught a variety of ECE classes, as well as Development programs including Public speaking for Grade 1-12."
      }
    ]
  },
  {
    "id": "ielts",
    "course": {
      "title": "IELTS Course",
      "coverImage": "/images/ieltsclass.jpg",
      "overviewTitle": "Course Overview",
      "overviewText": "Students receive intensive training to build English proficiency and test-taking strategies, ensuring confidence in achieving competitive scores for admission into top universities and schools worldwide."
    },
    "teachers": [
      {
        "name": "Mr. Stephen Ni",
        "photo": "/images/stephen.png",
        "education": "Founder of Vanlearn Education",
        "description": "Founder of Vanlearn International Education, with 20 years of university English teaching experience. An IELTS/TOEFL all-subject instructor holding a CERTESL (Certificate in Teaching English as a Second Language). Previously served as a lead reading and writing instructor at well-known training institutions such as New Oriental and Longre. Specializes in teaching and research in Adult ESL, Children’s ELL, and English Reading and Writing courses. Advocates a student-centered teaching philosophy that emphasizes the teacher’s role as a facilitator."
      }
    ]
  },
  {
    "id": "toefl",
    "course": {
      "title": "TOEFL Course",
      "coverImage": "/images/ieltsclass.jpg",
      "overviewTitle": "Course Overview",
      "overviewText": "Students receive intensive training to build English proficiency and test-taking strategies, ensuring confidence in achieving competitive scores for admission into top universities and schools worldwide."
    },
    "teachers": [
      {
        "name": "Mr. Stephen Ni",
        "photo": "/images/stephen.png",
        "education": "Founder of Vanlearn Education",
        "description": "Founder of Vanlearn International Education, with 20 years of university English teaching experience. An IELTS/TOEFL all-subject instructor holding a CERTESL (Certificate in Teaching English as a Second Language). Previously served as a lead reading and writing instructor at well-known training institutions such as New Oriental and Longre. Specializes in teaching and research in Adult ESL, Children’s ELL, and English Reading and Writing courses. Advocates a student-centered teaching philosophy that emphasizes the teacher’s role as a facilitator."
      }
    ]
  },
  {
    "id": "chinese",
    "course": {
      "title": "Chinese Language Course",
      "coverImage": "/images/chineseclass.jpg",
      "overviewTitle": "Course Overview",
      "overviewText": "Our Chinese program focuses on developing students’ listening, speaking, reading, and writing skills through engaging, real-life communication. Lessons integrate cultural exploration, including Chinese festivals, calligraphy, and traditions, to deepen understanding and appreciation of Chinese culture. Students build both language proficiency and cross-cultural awareness, gaining confidence to communicate effectively in academic and everyday contexts."
    },
    "teachers": [
      {
        "name": "Mr. Bai Jingbo",
        "photo": "/images/bai.jpg",
        "education": "Graduate of the Academy of Fine Arts, Liaoning Normal University",
        "description": "As a respected Chinese instructor in Canada, Bai Jingbo brings a rich background in media and writing to his teaching. His diverse experience—from university lecturing and journalism at CCTV to professional scriptwriting—has honed his deep expertise in Chinese language and literature. In the classroom, he leverages this unique perspective to help students appreciate linguistic nuances and cultural depth, fostering a learning environment that is both intellectually stimulating and culturally enriching."
      },
      {
        "name": "Ms. Jing",
        "photo": "/images/jing.jpg",
        "education": "",
        "description": "I am a dedicated Chinese language educator with over 20 years of teaching experience in Canada and China. I am highly familiar with a wide range of Mandarin curricula and teaching methods and specialize in tailoring lessons to meet each student’s individual needs. I believe language learning should be meaningful and enjoyable, so I integrate cultural stories, traditions, and values into my teaching to create engaging and effective learning experiences. My goal is to build students’ confidence and help them develop strong practical communication skills in Mandarin while fostering an appreciation for Chinese culture."
      },
      {
        "name": "Ms. Wu",
        "photo": "/images/wu.jpg",
        "education": "",
        "description": "A passionate Mandarin teacher with years of experience working with children and youth. I also hold a BC Education Assistant Certificate. Learning Mandarin should be a joyful journey! My classes focus on communication, creativity, and connection. Students learn through stories, games, and projects that link new vocabulary to real-life situations. Whether we’re talking about favorite foods or celebrating a festival, I make sure every lesson sparks curiosity and builds confidence. My goal is for every student to develop not only language skills but also a love for Chinese culture."
      }
    ]
  },
  {
    "id": "french",
    "course": {
      "title": "French Language Course",
      "coverImage": "",
      "overviewTitle": "Course Overview",
      "overviewText": "French courses focus on building students’ communication skills through practical listening, speaking, reading, and writing activities. Lessons integrate cultural exploration—such as French traditions, art, and daily life—to deepen understanding of the language in context. Through interactive projects and authentic materials, students develop confidence in expressing themselves and gain a global perspective rooted in Francophone culture."
    },
    "teachers": [
      {
        "name": "Ms. Zohra",
        "photo": "/images/zohra.jpg",
        "description": "Zohra is a certified teacher with over 25 years of experience teaching French. She began her teaching career in 1992 and has worked with children and adults in a variety of educational settings. Zohra is passionate about helping students develop strong communication skills and an appreciation for language and culture. Her teaching approach emphasizes engagement, clarity, and individualized support to meet each learner’s unique needs. Since joining our center last year, she has continued to inspire students to achieve excellence and confidence in their language learning journey."
      }
    ]
  },
  {
    "id": "japanese",
    "course": {
      "title": "Japanese Language Course",
      "overviewTitle": "Course Overview",
      "overviewText": "Japanese courses focus on developing comprehensive language skills in listening, speaking, reading, and writing. Students not only learn practical communication for daily and academic use but also explore Japanese culture, traditions, and modern society. Through interactive lessons, cultural projects, and real-life language practice, learners gain both linguistic proficiency and cross-cultural understanding, building confidence to connect with the world in Japanese."
    },
    "teachers": [
      {
        "name": "Ms. Luo",
        "photo": "/images/luo.png",
        "education": "",
        "description": "Specializes in teaching beginner, intermediate, and advanced Japanese. Studied in Japan and currently serves as a lecturer at top “Double World-Class,” 985, and 211 universities in China. With extensive experience in Japanese language teaching and JLPT preparation, she is recognized as an outstanding instructor dedicated to helping students achieve excellence."
      }
    ]
  },
  {
    "id": "mathematicstutor",
    "course": {
      "title": "Mathematics Tutoring",
      "overviewTitle": "Course Overview",
      "overviewText": "Mathematics courses are designed to develop listening, speaking, reading, and writing abilities in Chinese, French, and Japanese. Emphasis is placed on both linguistic proficiency and cultural literacy, helping students become confident communicators and global citizens."
    },
    "teachers": [
      {
        "name": "Mr. Hongxiang Lin",
        "photo": "/images/hongxianglin.jpg",
        "education": "Graduate of the Academy of Fine Arts, Liaoning Normal University",
        "description": "I hold a Master’s Degree in Engineering from McGill University, where I graduated with distinction and earned the Dean’s Honour List and several scholarships. With a strong foundation in mathematics, physics, and analytical problem-solving, I have extensive experience as a Teaching Assistant and Research Assistant, helping students grasp complex STEM concepts clearly and effectively. My academic and professional background allows me to connect theory with real-world applications, making lessons both logical and engaging. I am passionate about guiding students to build confidence and achieve academic success."
      }
    ]
  },
  {
    "id": "singaporemath",
    "course": {
      "title": "Singapore Math",
      "overviewTitle": "Course Overview",
      "overviewText": "Known globally for its structured and problem-solving approach, Singapore Math equips students with strong numerical fluency, logical reasoning, and conceptual understanding. Students are encouraged to think mathematically and apply multiple strategies to solve real-world problems."
    },
    "teachers": [
      {
        "name": "Mr. Hongxiang Lin",
        "photo": "/images/hongxianglin.jpg",
        "education": "Graduate of the Academy of Fine Arts, Liaoning Normal University",
        "description": "I hold a Master’s Degree in Engineering from McGill University, where I graduated with distinction and earned the Dean’s Honour List and several scholarships. With a strong foundation in mathematics, physics, and analytical problem-solving, I have extensive experience as a Teaching Assistant and Research Assistant, helping students grasp complex STEM concepts clearly and effectively. My academic and professional background allows me to connect theory with real-world applications, making lessons both logical and engaging. I am passionate about guiding students to build confidence and achieve academic success."
      }
    ]
  },
  {
    "id": "computerprogramming",
    "course": {
      "title": "Computer Programming",
      "overviewTitle": "Course Overview",
      "overviewText": "Our computer programming course introduces students to coding through Python, Scratch, and creative projects. With a project-based learning approach, students learn to design games, animations, and AI models while developing problem-solving and logical thinking skills. Guided by experienced instructors, this course builds a solid foundation for future study in computer science and technology."
    },
    "teachers": [
      {
        "name": "Mr. Mike",
        "photo": "/images/mike.jpg",
        "education": "Graduate of the Academy of Fine Arts, Liaoning Normal University",
        "description": "Mr. Mike specializes in using real-life examples to explain abstract concepts. He emphasizes personalized teaching and builds students’ confidence through interactive “error analysis” sessions. From illustrating functions with animations to creating fractal art in Python and designing “Geek Challenge” courses, he makes learning both engaging and inspiring. He once guided students to solve the classic “Chickens and Rabbits in the Same Cage” problem through coding—making knowledge both fun and meaningful."
      }
    ]
  },
  {
    "id": "piano",
    "course": {
      "title": "Piano & Guzheng",
      "coverImage": "/images/pianoclass.jpg",
      "overviewTitle": "Course Overview",
      "overviewText": "Students receive professional training in music performance and theory, building technical skill, musical expression, and discipline. Playing instruments such as the guzheng and piano not only enhances fine motor coordination but also fosters emotional expression and cultural appreciation."
    },
    "teachers": [
      {
        "name": "Ms. Vivian Wang",
        "photo": "/images/vivianwang.jpg",
        "education": "",
        "description": "She graduated from Minzu University of China and Renmin University of China, majoring in piano performance and pedagogy. She has been teaching piano for 18 years and has served as a judge and examiner for piano competitions in China for many years. Her teaching philosophy is individualized, tailoring lesson plans to each student's unique characteristics and needs. She hopes that under her guidance, every student will find their own joy and sense of accomplishment in the world of music."
      }
    ]
  },
  {
    "id": "chess",
    "course": {
      "title": "Chess",
      "coverImage": "/images/chessclass.jpg",
      "overviewTitle": "Course Overview",
      "overviewText": "In partnership with Penny Chess Club, where many international master-level coaches teach, this program sharpens strategic thinking, concentration, and decision-making. Chess builds patience, logic, and resilience, while also offering students opportunities to connect with a global community of learners."
    },
    "teachers": [
      {
        "name": "Ms. Penny",
        "photo": "/images/penny.png",
        "education": "Head Coach WIM Penny (Bich-Ngoc) Pham",
        "description": [
          "Woman International Master since 2010",
          "Fide Peak Rating:2238, CFC Peak Rating: 2294",
          "Silver Medal Asian Continental Woman Championship",
          "Winner of several national championships in Vietnam",
          "The first female Fide Trainer in Canada"
        ]
      }
    ]
  },
  {
    "id": "creativearts",
    "course": {
      "title": "Creative Art",
      "coverImage": "/images/creativeartsclass.jpg",
      "overviewTitle": "Course Overview",
      "overviewText": "Through exploration of the visual and performing arts, students cultivate artistic literacy and creative self-expression. The program encourages imagination, critical thinking, and appreciation for diverse artistic traditions, supporting both personal growth and cultural understanding."
    },
    "teachers": [
      {
        "name": "Ms. Bi Yu",
        "photo": "/images/biyu.jpg",
        "education": "Graduate of the Academy of Fine Arts, Liaoning Normal University",
        "description": [
          "Graduated from Shandong University of Art & Design with a major in Modeling Arts. In 2022, she completed watercolor and oil painting courses at AUArts . Member of the Alberta Society of Artists.",
          "She has been working in art education since 2011 and has extensive teaching experience. Passionate about painting, she patiently guides her students, many of whom have won awards in North American and Canadian art competitions. She has also been recognized multiple times as an outstanding art instructor"
        ]
      }
    ],
    "gallery": ["/images/arts-gallery-1.jpg", "/images/arts-gallery-2.jpg", "/images/arts-gallery-3.jpg"]
  },
  {
    "id": "sketching",
    "course": {
      "title": "Sketching",
      "coverImage": "/images/sketchclass.jpg",
      "overviewTitle": "Course Overview",
      "overviewText": "Through exploration of the visual and performing arts, students cultivate artistic literacy and creative self-expression. The program encourages imagination, critical thinking, and appreciation for diverse artistic traditions, supporting both personal growth and cultural understanding."
    },
    "teachers": [
      {
        "name": "Ms. Bi Yu",
        "photo": "/images/biyu.jpg",
        "education": "Graduate of the Academy of Fine Arts, Liaoning Normal University",
        "description": [
          "Graduated from Shandong University of Art & Design with a major in Modeling Arts. In 2022, she completed watercolor and oil painting courses at AUArts . Member of the Alberta Society of Artists.",
          "She has been working in art education since 2011 and has extensive teaching experience. Passionate about painting, she patiently guides her students, many of whom have won awards in North American and Canadian art competitions. She has also been recognized multiple times as an outstanding art instructor"
        ]
      }
    ],
    "gallery": ["/images/sketching-1.jpg", "/images/sketching-2.jpg", "/images/sketching-3.jpg"]
  },
  {
    "id": "animation",
    "course": {
      "title": "Animation",
      "overviewTitle": "Course Overview",
      "overviewText": [
        "Bring imagination to life through the art of animation!",
        "In this engaging and creative course, students will:",
        "🎬 Learn the fundamentals of animation and storytelling",
        "🎨 Explore character design, movement, and visual expression",
        "💻 Use beginner-friendly digital tools to create short animations",
        "🧠 Develop creative thinking, problem-solving, and teamwork skills",
        "🌟 Turn their ideas into fun, animated stories step by step",
        "Age Group: 7 years and above",
        "Goal: To inspire students to express their imagination through digital art and animation creation."
      ]
    },
    "teachers": [
      {
        "name": "Ms. Eric Hu",
        "photo": "/images/eric.jpg",
        "education": "",
        "description": "Chinese-Canadian animation artist with a strong background in both traditional and digital arts. A graduate of Beijing Film Academy and Vancouver Film School, he has contributed to several North American TV productions, bringing creative vision and technical expertise to animation storytelling."
      }
    ],
    "gallery": [
      "/images/20251109134354_222_1.jpg",
      "/images/20251109134354_223_1.png",
      "/images/20251109134354_224_1.jpg",
      "/images/20251109134355_226_1.jpg"
    ]
  },
  {
    "id": "fashiondesigner",
    "course": {
      "title": "Fashion Designer",
      "coverImage": "/images/fashiondesignerclass.jpg",
      "overviewTitle": "Course Overview",
      "overviewText": [
        "Let your child step into the world of fashion through creativity!",
        "In this fun and inspiring course, students will:",
        "👗 Learn the basics of fashion design and color coordination",
        "🎨 Explore fabrics, patterns, and simple sewing techniques",
        "🧵 Create their own stylish and unique fashion pieces",
        "🌟 Experience a new creative theme in every class",
        "💫 Build confidence, imagination, and a sense of style",
        "Age Group: 7 years and above",
        "Goal: To nurture children’s creativity and help them express their fashion dreams through hands-on design projects."
      ]
    },
    "teachers": [
      {
        "name": "Ms. Hera Yu",
        "photo": "/images/hera-2.jpg",
        "education": "Graduate of the Academy of Fine Arts, Liaoning Normal University",
        "description": "With over 10 years of experience, Ms. Yu specializes in watercolor, anime illustration, and creative design. She teaches children aged 4–15 and leads the After School Program, inspiring young artists to explore creativity and confidence through art."
      }
    ],
    "gallery": [
      "/images/20251109134434_227_1.jpg",
      "/images/20251109134435_228_1.jpg",
      "/images/20251109134435_229_1.jpg",
      "/images/20251109134436_230_1.jpg"
    ]
  }
]
